{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Hello\n",
    "\n",
    "![](./localhost.png)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import py2neo and connect to Neo4j\n",
    "from py2neo import Graph\n",
    "\n",
    "# Import pandas to make reading the outputs easier\n",
    "import pandas as pd\n",
    "\n",
    "# Import number generator to generate a random user ID and product ID to query\n",
    "from random import randint\n",
    "\n",
    "# textblob for the textblob-NLP stuff\n",
    "from textblob import TextBlob\n",
    "\n",
    "# just an example, replace with credentials for your own Neo4j instance\n",
    "graph = Graph(bolt=True, host=\"localhost\", http_port=7687, user='neo4j', password='kiss')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Hello world, sanity check\n",
    "graph.run(\"MATCH (a) RETURN COUNT(a) AS numberOfNodes\").evaluate()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Create constraints\n",
    "# graph.run(\"CREATE CONSTRAINT ON (c:Category) ASSERT c.name IS UNIQUE;\")\n",
    "# graph.run(\"CREATE CONSTRAINT ON (r:Recipe) ASSERT r.name is UNIQUE;\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Using APOC for the JSON import\n",
    "\n",
    "# graph.run(\"\"\"\n",
    "# CALL apoc.load.json(\"file:///epi_recipe_json_cleaned.json\")\n",
    "# YIELD value AS line\n",
    "# CREATE (recipe:Recipe {name: line.title, rating: toInteger(line.rating), ingredients: line.ingredients, directions: line.directions})\n",
    "# WITH recipe, line.categories AS categories\n",
    "# UNWIND categories AS cat\n",
    "# MERGE (c:Category {name:cat})\n",
    "# CREATE (recipe)-[:TAGGED_AS]->(c)\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Content-based Filtering\n",
    "\n",
    "Simple version, using just the number of common categories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "pd.set_option('display.max_columns', None)\n",
    "pd.set_option('display.max_colwidth', -1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>categories</th>\n",
       "      <th>commonCategories</th>\n",
       "      <th>rec.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[Gourmet, Soup/Stew, Fennel, Vegetable, Dairy]</td>\n",
       "      <td>5</td>\n",
       "      <td>Carrot, Fennel, and Orange Soup</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[Soup/Stew, Fennel, Vegetable, Potato, Dairy]</td>\n",
       "      <td>5</td>\n",
       "      <td>Fresh Fennel Vichyssoise</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[Gourmet, Soup/Stew, Vegetable, Potato, Dairy]</td>\n",
       "      <td>5</td>\n",
       "      <td>Salmon Chowder</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[Soup/Stew, Fennel, Vegetable, Potato]</td>\n",
       "      <td>4</td>\n",
       "      <td>Potato, Leek and Fennel Soup</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[Gourmet, Soup/Stew, Fennel, Potato]</td>\n",
       "      <td>4</td>\n",
       "      <td>Lobster \"Potpies\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[Gourmet, Soup/Stew, Vegetable, Dairy]</td>\n",
       "      <td>4</td>\n",
       "      <td>Zucchini Ginger Cupcakes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[Soup/Stew, Vegetable, Potato, Dairy]</td>\n",
       "      <td>4</td>\n",
       "      <td>Cream of Potato Soup with Watercress</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[Gourmet, Soup/Stew, Vegetable, Dairy]</td>\n",
       "      <td>4</td>\n",
       "      <td>Sweet Red Pepper Soup</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[Gourmet, Soup/Stew, Vegetable, Dairy]</td>\n",
       "      <td>4</td>\n",
       "      <td>Lobster Bisque</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[Gourmet, Soup/Stew, Vegetable, Dairy]</td>\n",
       "      <td>4</td>\n",
       "      <td>Chilled Minted Zucchini Soup</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       categories  commonCategories  \\\n",
       "0  [Gourmet, Soup/Stew, Fennel, Vegetable, Dairy]  5                  \n",
       "1  [Soup/Stew, Fennel, Vegetable, Potato, Dairy]   5                  \n",
       "2  [Gourmet, Soup/Stew, Vegetable, Potato, Dairy]  5                  \n",
       "3  [Soup/Stew, Fennel, Vegetable, Potato]          4                  \n",
       "4  [Gourmet, Soup/Stew, Fennel, Potato]            4                  \n",
       "5  [Gourmet, Soup/Stew, Vegetable, Dairy]          4                  \n",
       "6  [Soup/Stew, Vegetable, Potato, Dairy]           4                  \n",
       "7  [Gourmet, Soup/Stew, Vegetable, Dairy]          4                  \n",
       "8  [Gourmet, Soup/Stew, Vegetable, Dairy]          4                  \n",
       "9  [Gourmet, Soup/Stew, Vegetable, Dairy]          4                  \n",
       "\n",
       "                               rec.name  \n",
       "0  Carrot, Fennel, and Orange Soup       \n",
       "1  Fresh Fennel Vichyssoise              \n",
       "2  Salmon Chowder                        \n",
       "3  Potato, Leek and Fennel Soup          \n",
       "4  Lobster \"Potpies\"                     \n",
       "5  Zucchini Ginger Cupcakes              \n",
       "6  Cream of Potato Soup with Watercress  \n",
       "7  Sweet Red Pepper Soup                 \n",
       "8  Lobster Bisque                        \n",
       "9  Chilled Minted Zucchini Soup          "
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(graph.data(\"\"\"\n",
    "MATCH (m:Recipe)-[:TAGGED_AS]->(g:Category)<-[:TAGGED_AS]-(rec:Recipe)\n",
    "WHERE m.name = 'Potato and Fennel Soup Hodge'\n",
    "WITH rec, COLLECT(g.name) AS categories, COUNT(*) AS commonCategories\n",
    "RETURN rec.name, categories, commonCategories\n",
    "ORDER BY commonCategories DESC \n",
    "LIMIT 10\"\"\"))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>jaccard</th>\n",
       "      <th>recommendation</th>\n",
       "      <th>s1</th>\n",
       "      <th>s2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.357143</td>\n",
       "      <td>Thai Chicken Stock</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Soup/Stew, Gourmet, Garlic, Chicken, Cilantro, Ginger]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.352941</td>\n",
       "      <td>Curried Chicken Coconut Noodle Soup</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Chicken, Ginger, Soup/Stew, Curry, Winter, Pasta, Coconut, Gourmet, Lemongrass, Cilantro]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.333333</td>\n",
       "      <td>Hainanese Chicken Rice</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Gourmet, Hot Pepper, Rice, Ginger, Garlic, Chicken, Soup/Stew]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.300000</td>\n",
       "      <td>Aromatic Shrimp And Noodle Medicine Soup</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Lemongrass, Soup/Stew, Bon Appétit, Dairy Free, Winter, Healthy, Dinner, Ginger, Green Onion/Scallion, Noodle, Shrimp, Peanut Free, Soy Free]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.294118</td>\n",
       "      <td>Coconut Sauce</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Coconut, Quick &amp; Easy, Gourmet, Lemongrass, Chicken, Blender, Herb, Ginger, Sauce]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0.294118</td>\n",
       "      <td>Chicken, Red Pepper, and Green Bean Stir-Fry</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Ginger, Chicken, Bon Appétit, Sesame, Lemongrass, Spring, Quick &amp; Easy, Stir-Fry, Pepper]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>0.294118</td>\n",
       "      <td>Matzo Balls in Southeast Asian Broth</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Cilantro, Bon Appétit, Kosher, Lemongrass, Passover, Spring, Chicken, Ginger, Soup/Stew]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>0.291667</td>\n",
       "      <td>Thai Shrimp Soup with Lemon and Jalapenos</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Chicken, Soup/Stew, Pork, Ginger, Lunch, Shellfish, Coconut, Lemon, Healthy, Shrimp, No Sugar Added, Soy Free, Tree Nut Free, Peanut Free, Dairy Free, Sugar Conscious, Bon Appétit, Jalapeño]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>0.285714</td>\n",
       "      <td>Coconut Shrimp with Tamarind Ginger Sauce</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Peanut Free, Tree Nut Free, Soy Free, Tamarind, Gourmet, Pescatarian, Dairy Free, Cocktail Party, Coconut, Shrimp, Summer, Ginger, Appetizer, Fry]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>0.285714</td>\n",
       "      <td>Chile-Pepper Water</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Ginger, Pepper, Winter, Gourmet, Garlic]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    jaccard                                recommendation  \\\n",
       "0  0.357143  Thai Chicken Stock                             \n",
       "1  0.352941  Curried Chicken Coconut Noodle Soup            \n",
       "2  0.333333  Hainanese Chicken Rice                         \n",
       "3  0.300000  Aromatic Shrimp And Noodle Medicine Soup       \n",
       "4  0.294118  Coconut Sauce                                  \n",
       "5  0.294118  Chicken, Red Pepper, and Green Bean Stir-Fry   \n",
       "6  0.294118  Matzo Balls in Southeast Asian Broth           \n",
       "7  0.291667  Thai Shrimp Soup with Lemon and Jalapenos      \n",
       "8  0.285714  Coconut Shrimp with Tamarind Ginger Sauce      \n",
       "9  0.285714  Chile-Pepper Water                             \n",
       "\n",
       "                                                                                                                               s1  \\\n",
       "0  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "1  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "2  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "3  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "4  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "5  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "6  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "7  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "8  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "9  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "\n",
       "                                                                                                                                                                                                s2  \n",
       "0  [Soup/Stew, Gourmet, Garlic, Chicken, Cilantro, Ginger]                                                                                                                                          \n",
       "1  [Chicken, Ginger, Soup/Stew, Curry, Winter, Pasta, Coconut, Gourmet, Lemongrass, Cilantro]                                                                                                       \n",
       "2  [Gourmet, Hot Pepper, Rice, Ginger, Garlic, Chicken, Soup/Stew]                                                                                                                                  \n",
       "3  [Lemongrass, Soup/Stew, Bon Appétit, Dairy Free, Winter, Healthy, Dinner, Ginger, Green Onion/Scallion, Noodle, Shrimp, Peanut Free, Soy Free]                                                   \n",
       "4  [Coconut, Quick & Easy, Gourmet, Lemongrass, Chicken, Blender, Herb, Ginger, Sauce]                                                                                                              \n",
       "5  [Ginger, Chicken, Bon Appétit, Sesame, Lemongrass, Spring, Quick & Easy, Stir-Fry, Pepper]                                                                                                       \n",
       "6  [Cilantro, Bon Appétit, Kosher, Lemongrass, Passover, Spring, Chicken, Ginger, Soup/Stew]                                                                                                        \n",
       "7  [Chicken, Soup/Stew, Pork, Ginger, Lunch, Shellfish, Coconut, Lemon, Healthy, Shrimp, No Sugar Added, Soy Free, Tree Nut Free, Peanut Free, Dairy Free, Sugar Conscious, Bon Appétit, Jalapeño]  \n",
       "8  [Peanut Free, Tree Nut Free, Soy Free, Tamarind, Gourmet, Pescatarian, Dairy Free, Cocktail Party, Coconut, Shrimp, Summer, Ginger, Appetizer, Fry]                                              \n",
       "9  [Ginger, Pepper, Winter, Gourmet, Garlic]                                                                                                                                                        "
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(graph.data(\"\"\"\n",
    "MATCH (r:Recipe {name: \"Spicy Noodle Soup\"})-[:TAGGED_AS]->(c:Category)<-[:TAGGED_AS]-(other:Recipe)\n",
    "WITH r, other, COUNT(c) AS intersection, COLLECT(c.name) AS i\n",
    "\n",
    "MATCH (r)-[:TAGGED_AS]->(rc:Category)\n",
    "WITH r, other, intersection, i, COLLECT(rc.name) AS s1\n",
    "\n",
    "MATCH (other)-[:TAGGED_AS]->(oc:Category)\n",
    "WITH r, other, intersection, i,  s1, COLLECT(oc.name) AS s2\n",
    "\n",
    "WITH r, other, intersection, s1, s2\n",
    "\n",
    "WITH r, other, intersection, s1+filter(x IN s2 WHERE NOT x IN s1) AS union, s1, s2\n",
    "\n",
    "RETURN other.name AS recommendation, s1, s2,((1.0*intersection)/SIZE(union)) AS jaccard \n",
    "ORDER BY jaccard DESC \n",
    "LIMIT 10\"\"\"))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Add a rating comparison, i.e. the rating of the recommendation can't be lower than the rating of the recipe being searched."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>jaccard</th>\n",
       "      <th>recommendation</th>\n",
       "      <th>s1</th>\n",
       "      <th>s2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.333333</td>\n",
       "      <td>Hainanese Chicken Rice</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Gourmet, Hot Pepper, Rice, Ginger, Garlic, Chicken, Soup/Stew]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.300000</td>\n",
       "      <td>Aromatic Shrimp And Noodle Medicine Soup</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Lemongrass, Soup/Stew, Bon Appétit, Dairy Free, Winter, Healthy, Dinner, Ginger, Green Onion/Scallion, Noodle, Shrimp, Peanut Free, Soy Free]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.294118</td>\n",
       "      <td>Coconut Sauce</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Coconut, Quick &amp; Easy, Gourmet, Lemongrass, Chicken, Blender, Herb, Ginger, Sauce]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.291667</td>\n",
       "      <td>Thai Shrimp Soup with Lemon and Jalapenos</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Chicken, Soup/Stew, Pork, Ginger, Lunch, Shellfish, Coconut, Lemon, Healthy, Shrimp, No Sugar Added, Soy Free, Tree Nut Free, Peanut Free, Dairy Free, Sugar Conscious, Bon Appétit, Jalapeño]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.285714</td>\n",
       "      <td>Coconut Shrimp with Tamarind Ginger Sauce</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Peanut Free, Tree Nut Free, Soy Free, Tamarind, Gourmet, Pescatarian, Dairy Free, Cocktail Party, Coconut, Shrimp, Summer, Ginger, Appetizer, Fry]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0.280000</td>\n",
       "      <td>Pigeon-Pea Soup</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[No Sugar Added, Dairy Free, Peanut Free, Tree Nut Free, Soy Free, Plantain, Jalapeño, Cilantro, Gourmet, Sausage, Hot Pepper, Butternut Squash, Spring, Pork, Pepper, Lunch, Vegetable, Garlic, Soup/Stew]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>0.277778</td>\n",
       "      <td>Thai-Style Chicken and Rice Soup</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Coconut, Rice, Poultry, Ginger, Chicken, Soup/Stew, Winter, Curry, Gourmet, Cilantro]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>0.277778</td>\n",
       "      <td>Chicken and Cashew Stir-Fry</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Wok, Chicken, Quick &amp; Easy, Gourmet, Pepper, Stir-Fry, Nut, Onion, Garlic, Ginger]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>0.272727</td>\n",
       "      <td>Shrimp Sambal</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Macadamia Nut, Shrimp, Spice, Hot Pepper, Spring, Simmer, Gourmet, Food Processor, Garlic, Ginger, Nut, Onion, Sauté, Quick &amp; Easy, Coconut]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>0.266667</td>\n",
       "      <td>Chicken with Garlic Sauce</td>\n",
       "      <td>[Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]</td>\n",
       "      <td>[Garlic, Herb, Chicken, Gourmet, Poultry, Spring]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    jaccard                             recommendation  \\\n",
       "0  0.333333  Hainanese Chicken Rice                      \n",
       "1  0.300000  Aromatic Shrimp And Noodle Medicine Soup    \n",
       "2  0.294118  Coconut Sauce                               \n",
       "3  0.291667  Thai Shrimp Soup with Lemon and Jalapenos   \n",
       "4  0.285714  Coconut Shrimp with Tamarind Ginger Sauce   \n",
       "5  0.280000  Pigeon-Pea Soup                             \n",
       "6  0.277778  Thai-Style Chicken and Rice Soup            \n",
       "7  0.277778  Chicken and Cashew Stir-Fry                 \n",
       "8  0.272727  Shrimp Sambal                               \n",
       "9  0.266667  Chicken with Garlic Sauce                   \n",
       "\n",
       "                                                                                                                               s1  \\\n",
       "0  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "1  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "2  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "3  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "4  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "5  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "6  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "7  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "8  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "9  [Soup/Stew, Coconut, Breakfast, Spring, Shrimp, Garlic, Chicken, Pepper, Ginger, Gourmet, Lemongrass, Peanut Free, Dairy Free]   \n",
       "\n",
       "                                                                                                                                                                                                            s2  \n",
       "0  [Gourmet, Hot Pepper, Rice, Ginger, Garlic, Chicken, Soup/Stew]                                                                                                                                              \n",
       "1  [Lemongrass, Soup/Stew, Bon Appétit, Dairy Free, Winter, Healthy, Dinner, Ginger, Green Onion/Scallion, Noodle, Shrimp, Peanut Free, Soy Free]                                                               \n",
       "2  [Coconut, Quick & Easy, Gourmet, Lemongrass, Chicken, Blender, Herb, Ginger, Sauce]                                                                                                                          \n",
       "3  [Chicken, Soup/Stew, Pork, Ginger, Lunch, Shellfish, Coconut, Lemon, Healthy, Shrimp, No Sugar Added, Soy Free, Tree Nut Free, Peanut Free, Dairy Free, Sugar Conscious, Bon Appétit, Jalapeño]              \n",
       "4  [Peanut Free, Tree Nut Free, Soy Free, Tamarind, Gourmet, Pescatarian, Dairy Free, Cocktail Party, Coconut, Shrimp, Summer, Ginger, Appetizer, Fry]                                                          \n",
       "5  [No Sugar Added, Dairy Free, Peanut Free, Tree Nut Free, Soy Free, Plantain, Jalapeño, Cilantro, Gourmet, Sausage, Hot Pepper, Butternut Squash, Spring, Pork, Pepper, Lunch, Vegetable, Garlic, Soup/Stew]  \n",
       "6  [Coconut, Rice, Poultry, Ginger, Chicken, Soup/Stew, Winter, Curry, Gourmet, Cilantro]                                                                                                                       \n",
       "7  [Wok, Chicken, Quick & Easy, Gourmet, Pepper, Stir-Fry, Nut, Onion, Garlic, Ginger]                                                                                                                          \n",
       "8  [Macadamia Nut, Shrimp, Spice, Hot Pepper, Spring, Simmer, Gourmet, Food Processor, Garlic, Ginger, Nut, Onion, Sauté, Quick & Easy, Coconut]                                                                \n",
       "9  [Garlic, Herb, Chicken, Gourmet, Poultry, Spring]                                                                                                                                                            "
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(graph.data(\"\"\"\n",
    "MATCH (r:Recipe {name: \"Spicy Noodle Soup\"})-[:TAGGED_AS]->(c:Category)<-[:TAGGED_AS]-(other:Recipe)\n",
    "WITH r, other, COUNT(c) AS intersection, COLLECT(c.name) AS i\n",
    "\n",
    "MATCH (r)-[:TAGGED_AS]->(rc:Category)\n",
    "WITH r, other, intersection, i, COLLECT(rc.name) AS s1\n",
    "\n",
    "MATCH (other)-[:TAGGED_AS]->(oc:Category)\n",
    "WITH r, other, intersection, i,  s1, COLLECT(oc.name) AS s2\n",
    "\n",
    "WITH r, other, intersection, s1, s2\n",
    "\n",
    "WITH r, other, intersection, s1+filter(x IN s2 WHERE NOT x IN s1) AS union, s1, s2\n",
    "\n",
    "WHERE other.rating >= r.rating\n",
    "\n",
    "RETURN other.name AS recommendation, s1,s2,((1.0*intersection)/SIZE(union)) AS jaccard \n",
    "ORDER BY jaccard DESC \n",
    "LIMIT 10\"\"\"))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "product_name = \"Organic Large Extra Fancy Fuji Apple\"\n",
    "words = product_name.split()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Organic', 'Large', 'Extra', 'Fancy', 'Fuji', 'Apple']"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "words"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>jaccard</th>\n",
       "      <th>recommendation</th>\n",
       "      <th>s1</th>\n",
       "      <th>s2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.166667</td>\n",
       "      <td>Apple Cobblers</td>\n",
       "      <td>[Gourmet, Apple, Bake, Side, Fruit]</td>\n",
       "      <td>[Apple, Fall, Fruit, Bake, Gourmet]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.166667</td>\n",
       "      <td>Cumin Apple Chips</td>\n",
       "      <td>[Apple, Fall, Fruit, Bake, Gourmet]</td>\n",
       "      <td>[Gourmet, Apple, Bake, Side, Fruit]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.166667</td>\n",
       "      <td>Apple Cobblers</td>\n",
       "      <td>[Fall, Gourmet, Apple, Bake, Dessert, Fruit]</td>\n",
       "      <td>[Apple, Fall, Fruit, Bake, Gourmet]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.166667</td>\n",
       "      <td>Glazed Apple Rings</td>\n",
       "      <td>[Apple, Fall, Fruit, Bake, Gourmet]</td>\n",
       "      <td>[Fall, Gourmet, Apple, Bake, Dessert, Fruit]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.142857</td>\n",
       "      <td>Calvados Tarte Tatin</td>\n",
       "      <td>[Fall, Gourmet, Apple, Bake, Dessert, Fruit]</td>\n",
       "      <td>[Dessert, Liqueur, Gourmet, Fall, Apple, Bake]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0.142857</td>\n",
       "      <td>Apple Cobblers</td>\n",
       "      <td>[Phyllo/Puff Pastry Dough, Gourmet, Apple, Fall, Dessert, Bake]</td>\n",
       "      <td>[Apple, Fall, Fruit, Bake, Gourmet]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>0.142857</td>\n",
       "      <td>Thin Apple Tarts</td>\n",
       "      <td>[Dessert, Liqueur, Gourmet, Fall, Apple, Bake]</td>\n",
       "      <td>[Phyllo/Puff Pastry Dough, Gourmet, Apple, Fall, Dessert, Bake]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>0.142857</td>\n",
       "      <td>Cumin Apple Chips</td>\n",
       "      <td>[Fall, Gourmet, Apple, Bake, Dessert, Fruit]</td>\n",
       "      <td>[Gourmet, Apple, Bake, Side, Fruit]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>0.142857</td>\n",
       "      <td>Calvados Tarte Tatin</td>\n",
       "      <td>[Phyllo/Puff Pastry Dough, Gourmet, Apple, Fall, Dessert, Bake]</td>\n",
       "      <td>[Dessert, Liqueur, Gourmet, Fall, Apple, Bake]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>0.142857</td>\n",
       "      <td>Glazed Apple Rings</td>\n",
       "      <td>[Phyllo/Puff Pastry Dough, Gourmet, Apple, Fall, Dessert, Bake]</td>\n",
       "      <td>[Fall, Gourmet, Apple, Bake, Dessert, Fruit]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    jaccard        recommendation  \\\n",
       "0  0.166667  Apple Cobblers         \n",
       "1  0.166667  Cumin Apple Chips      \n",
       "2  0.166667  Apple Cobblers         \n",
       "3  0.166667  Glazed Apple Rings     \n",
       "4  0.142857  Calvados Tarte Tatin   \n",
       "5  0.142857  Apple Cobblers         \n",
       "6  0.142857  Thin Apple Tarts       \n",
       "7  0.142857  Cumin Apple Chips      \n",
       "8  0.142857  Calvados Tarte Tatin   \n",
       "9  0.142857  Glazed Apple Rings     \n",
       "\n",
       "                                                                s1  \\\n",
       "0  [Gourmet, Apple, Bake, Side, Fruit]                               \n",
       "1  [Apple, Fall, Fruit, Bake, Gourmet]                               \n",
       "2  [Fall, Gourmet, Apple, Bake, Dessert, Fruit]                      \n",
       "3  [Apple, Fall, Fruit, Bake, Gourmet]                               \n",
       "4  [Fall, Gourmet, Apple, Bake, Dessert, Fruit]                      \n",
       "5  [Phyllo/Puff Pastry Dough, Gourmet, Apple, Fall, Dessert, Bake]   \n",
       "6  [Dessert, Liqueur, Gourmet, Fall, Apple, Bake]                    \n",
       "7  [Fall, Gourmet, Apple, Bake, Dessert, Fruit]                      \n",
       "8  [Phyllo/Puff Pastry Dough, Gourmet, Apple, Fall, Dessert, Bake]   \n",
       "9  [Phyllo/Puff Pastry Dough, Gourmet, Apple, Fall, Dessert, Bake]   \n",
       "\n",
       "                                                                s2  \n",
       "0  [Apple, Fall, Fruit, Bake, Gourmet]                              \n",
       "1  [Gourmet, Apple, Bake, Side, Fruit]                              \n",
       "2  [Apple, Fall, Fruit, Bake, Gourmet]                              \n",
       "3  [Fall, Gourmet, Apple, Bake, Dessert, Fruit]                     \n",
       "4  [Dessert, Liqueur, Gourmet, Fall, Apple, Bake]                   \n",
       "5  [Apple, Fall, Fruit, Bake, Gourmet]                              \n",
       "6  [Phyllo/Puff Pastry Dough, Gourmet, Apple, Fall, Dessert, Bake]  \n",
       "7  [Gourmet, Apple, Bake, Side, Fruit]                              \n",
       "8  [Dessert, Liqueur, Gourmet, Fall, Apple, Bake]                   \n",
       "9  [Fall, Gourmet, Apple, Bake, Dessert, Fruit]                     "
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(graph.data(\"\"\"\n",
    "MATCH (r:Recipe)-[:TAGGED_AS]->(c:Category)<-[:TAGGED_AS]-(other:Recipe)\n",
    "WHERE c.name IN ['Organic', 'Large', 'Extra', 'Fancy', 'Fuji', 'Apple']\n",
    "WITH r, other, COUNT(c) AS intersection, COLLECT(c.name) AS i\n",
    "\n",
    "MATCH (r)-[:TAGGED_AS]->(rc:Category)\n",
    "WITH r, other, intersection, i, COLLECT(rc.name) AS s1\n",
    "\n",
    "MATCH (other)-[:TAGGED_AS]->(oc:Category)\n",
    "WITH r, other, intersection, i,  s1, COLLECT(oc.name) AS s2\n",
    "\n",
    "WITH r, other, intersection, s1, s2\n",
    "\n",
    "WITH r, other, intersection, s1+filter(x IN s2 WHERE NOT x IN s1) AS union, s1, s2\n",
    "\n",
    "RETURN other.name AS recommendation, s1, s2,((1.0*intersection)/SIZE(union)) AS jaccard \n",
    "ORDER BY jaccard DESC \n",
    "LIMIT 10\"\"\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "But the above query took a long while to run. This might be the more computationaly efficient way..."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>categories</th>\n",
       "      <th>commonCategories</th>\n",
       "      <th>rec.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[Apple]</td>\n",
       "      <td>1</td>\n",
       "      <td>Apple and Caraway Tartlets with Cinnamon-Clove Ice Cream and Cider-Caramel Sauce</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[Apple]</td>\n",
       "      <td>1</td>\n",
       "      <td>Apple Cheddar Bread Pudding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[Apple]</td>\n",
       "      <td>1</td>\n",
       "      <td>Kielbasa with Golden Onions and Apple</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[Apple]</td>\n",
       "      <td>1</td>\n",
       "      <td>Calf's Liver with Apples and Onions</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[Apple]</td>\n",
       "      <td>1</td>\n",
       "      <td>Apple Pancakes with Cinnamon Butter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[Apple]</td>\n",
       "      <td>1</td>\n",
       "      <td>Cranberry Apricot Pecan Strudel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[Apple]</td>\n",
       "      <td>1</td>\n",
       "      <td>Ben's Chunky Applesauce</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[Apple]</td>\n",
       "      <td>1</td>\n",
       "      <td>Mincemeat Muffins</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[Apple]</td>\n",
       "      <td>1</td>\n",
       "      <td>Warm Baked Apples with Cranberry-Caramel Sauce</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[Apple]</td>\n",
       "      <td>1</td>\n",
       "      <td>Warm Sweet-Potato Pudding with Apples and Chestnuts</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  categories  commonCategories  \\\n",
       "0  [Apple]    1                  \n",
       "1  [Apple]    1                  \n",
       "2  [Apple]    1                  \n",
       "3  [Apple]    1                  \n",
       "4  [Apple]    1                  \n",
       "5  [Apple]    1                  \n",
       "6  [Apple]    1                  \n",
       "7  [Apple]    1                  \n",
       "8  [Apple]    1                  \n",
       "9  [Apple]    1                  \n",
       "\n",
       "                                                                           rec.name  \n",
       "0  Apple and Caraway Tartlets with Cinnamon-Clove Ice Cream and Cider-Caramel Sauce  \n",
       "1  Apple Cheddar Bread Pudding                                                       \n",
       "2  Kielbasa with Golden Onions and Apple                                             \n",
       "3  Calf's Liver with Apples and Onions                                               \n",
       "4  Apple Pancakes with Cinnamon Butter                                               \n",
       "5  Cranberry Apricot Pecan Strudel                                                   \n",
       "6  Ben's Chunky Applesauce                                                           \n",
       "7  Mincemeat Muffins                                                                 \n",
       "8  Warm Baked Apples with Cranberry-Caramel Sauce                                    \n",
       "9  Warm Sweet-Potato Pudding with Apples and Chestnuts                               "
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(graph.data(\"\"\"\n",
    "MATCH (m:Recipe)-[:TAGGED_AS]->(c:Category)<-[:TAGGED_AS]-(rec:Recipe)\n",
    "WHERE c.name IN ['Organic', 'Large', 'Extra', 'Fancy', 'Fuji', 'Apple']\n",
    "WITH rec, COLLECT(DISTINCT c.name) AS categories, COUNT(DISTINCT c) AS commonCategories\n",
    "RETURN rec.name, categories, commonCategories\n",
    "ORDER BY commonCategories DESC \n",
    "LIMIT 10\"\"\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
